---
kind: property
id: P:Autodesk.Revit.DB.ElementNode.Document
zh: 文档、文件
source: html/140d8019-121f-927e-6388-c3db5d767956.htm
---
# Autodesk.Revit.DB.ElementNode.Document Property

**中文**: 文档、文件

Gets the document associated with the element.

## Syntax (C#)
```csharp
public Document Document { get; }
```

## Remarks
The document is in read-only state. Transactions are not allowed in it.